---
type: ViewScheduleExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# ViewScheduleExportOptions

`Autodesk.Revit.DB.ViewScheduleExportOptions` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ViewScheduleExportOptions | — | `` |
| Constructor | ViewScheduleExportOptions | 2013 | `public ViewScheduleExportOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | ColumnHeaders | 2013 | `public ExportColumnHeaders ColumnHeaders { get ; set ; }` |
| Property | FieldDelimiter | 2013 | `public string FieldDelimiter { get ; set ; }` |
| Property | HeadersFootersBlanks | 2013 | `public bool HeadersFootersBlanks { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | TextQualifier | 2013 | `public ExportTextQualifier TextQualifier { get ; set ; }` |
| Property | Title | 2014 | `public bool Title { get ; set ; }` |